package main

import (
	"fmt"
	"io/ioutil"
	//"os"
)

var arr = map[string]string {
	"╔══╗" +
	"║╔╗║" +
	"║╚╝║" +
	"║╔╗║" +
	"║║║║" +
	"╚╝╚╝": "а",
	"╔═══╗" +
	"║╔══╝" +
	"║╚══╗" +
	"║╔═╗║" +
	"║╚═╝║" +
	"╚═══╝": "б",
	"╔══╗ " +
	"║╔╗║ " +
	"║╚╝╚╗" +
	"║╔═╗║" +
	"║╚═╝║" +
	"╚═══╝":"в",
	"╔══╗" +
	"║╔═╝" +
	"║║  " +
	"║║  " +
	"║║  " +
	"╚╝  ":"г",
	" ╔══╗ " +
	" ║╔╗║ " +
	" ║║║║ " +
	" ║║║║ " +
	"╔╝╚╝╚╗" +
	"╚════╝":"д",
	"╔═══╗" +
	"║╔══╝" +
	"║╚══╗" +
	"║╔══╝" +
	"║╚══╗" +
	"╚═══╝":"е",
	"╔╩═╩╗" +
	"║╔══╝" +
	"║╚══╗" +
	"║╔══╝" +
	"║╚══╗" +
	"╚═══╝":"ё",
	"╔╗╔╗╔╗" +
	"║║║║║║" +
	"║╚╝╚╝║" +
	"║╔╗╔╗║" +
	"║║║║║║" +
	"╚╝╚╝╚╝":"ж",
	"╔═══╗" +
	"╚══╗║" +
	" ╔═╝║" +
	" ╚═╗║" +
	"╔══╝║" +
	"╚═══╝":"з",
	"╔╗╔╗" +
	"║║║║" +
	"║║║║" +
	"║║╔║" +
	"║╚╝║" +
	"╚══╝":"и",
	"╔╗╩╔╗" +
	"║║ ║║" +
	"║║ ║║" +
	"║║ ╔║" +
	"║╚═╝║" +
	"╚═══╝":"й",
	"╔╗╔══╗" +
	"║║║╔═╝" +
	"║╚╝║  " +
	"║╔╗║  " +
	"║║║╚═╗" +
	"╚╝╚══╝":"к",
	" ╔══╗" +
	" ║╔╗║" +
	" ║║║║" +
	" ║║║║" +
	"╔╝║║║" +
	"╚═╝╚╝":"л",
	"╔╗  ╔╗" +
	"║║  ║║" +
	"║╚╗╔╝║" +
	"║╔╗╔╗║" +
	"║║╚╝║║" +
	"╚╝  ╚╝":"м",
	"╔╗╔╗" +
	"║║║║" +
	"║╚╝║" +
	"║╔╗║" +
	"║║║║" +
	"╚╝╚╝":"н",
	"╔══╗" +
	"║╔╗║" +
	"║║║║" +
	"║║║║" +
	"║╚╝║" +
	"╚══╝":"о",
	"╔══╗" +
	"║╔╗║" +
	"║║║║" +
	"║║║║" +
	"║║║║" +
	"╚╝╚╝":"п",
	"╔═══╗" +
	"║╔═╗║" +
	"║╚═╝║" +
	"║╔══╝" +
	"║║   " +
	"╚╝   ":"р",
	"╔══╗" +
	"║╔═╝" +
	"║║  " +
	"║║  " +
	"║╚═╗" +
	"╚══╝":"с",
	"╔════╗" +
	"╚═╗╔═╝" +
	"  ║║  " +
	"  ║║  " +
	"  ║║  " +
	"  ╚╝  ":"т",
	"╔╗╔╗" +
	"║║║║" +
	"║╚╝║" +
	"╚═╗║" +
	" ╔╝║" +
	" ╚═╝":"у",
	"╔═════╗" +
	"║ ╔╦╗ ║" +
	"║ ║║║ ║" +
	"║ ╚╩╝ ║" +
	"╚═╗ ╔═╝" +
	"  ╚═╝  ":"ф",
	"╔══╗╔══╗" +
	"╚═╗║║╔═╝" +
	"  ║╚╝║  " +
	"  ║╔╗║  " +
	"╔═╝║║╚═╗" +
	"╚══╝╚══╝":"х",
	"╔╗╔╗" +
	"║║║║" +
	"║║║║" +
	"║║║║" +
	"║╚╝║" +
	"╚══╗":"ц",
	"╔╗╔╗" +
	"║║║║" +
	"║╚╝║" +
	"╚═╗║" +
	"  ║║" +
	"  ╚╝":"ч",
	"╔╗╔╗╔╗" +
	"║║║║║║" +
	"║║║║║║" +
	"║║║║║║" +
	"║╚╝╚╝║" +
	"╚════╝":"ш",
	"╔╗╔╗╔╗" +
	"║║║║║║" +
	"║║║║║║" +
	"║║║║║║" +
	"║╚╝╚╝║" +
	"╚════╗":"щ",
	"═╗   " +
	"╗║   " +
	"║╚══╗" +
	"║╔═╗║" +
	"║╚═╝║" +
	"╚═══╝":"ъ",
	"╔╗  ╔╗" +
	"║║  ║║" +
	"║╚══╣║" +
	"║╔═╗║║" +
	"║╚═╝║║" +
	"╚═══╩╝":"ы",
	"╔╗   " +
	"║║   " +
	"║╚══╗" +
	"║╔═╗║" +
	"║╚═╝║" +
	"╚═══╝":"ь",
	"╔═══╗" +
	"╚══╗║" +
	" ╔═╝╝" +
	" ╚═╗╗" +
	"╔══╝║" +
	"╚═══╝":"э",
	"╔╗╔══╗" +
	"║║║╔╗║" +
	"║╚╝║║║" +
	"║╔╗║║║" +
	"║║║╚╝║" +
	"╚╝╚══╝":"ю",
	"╔═══╗" +
	"║╔═╗║" +
	"║╚═╝║" +
	"╚╗╔╗║" +
	" ║║║║" +
	" ╚╝╚╝":"я",
		"  " +
		"  " +
		"  " +
		"  " +
		"╔╗"+
		"╚╣": ",",
	"  " +
		"  " +
		"  " +
		"  " +
		"╔╗"+
		"╚╝": ".",
	"╔═╗" +
	"╚╗║" +
	"╔╝║" +
	"║╔╝" +
	"╔╗ " +
	"╚╝ ": "?",
	"╔╗" +
		"╚╝" +
		"  " +
		"  " +
		"  " +
		"  ": "'",

		"║║" +
		"║║" +
		"╚╝" +
		"╔╗" +
		"╚╝":"!",
	"  " +
		"╔╗" +
		"╚╝" +
		"╔╗" +
		"╚╣" +
		"  ": ";",
	"  " +
		"╔╗" +
		"╚╝" +
		"╔╗" +
		"╚╝" +
		"  ": ":",
	"╔═╗" +
		"╚╗║" +
		" ║║" +
		" ║║" +
		"╔╝║" +
		"╚═╝": ")",
	"╔═╗" +
		"║╔╝" +
		"║║ " +
		"║║ " +
		"║╚╗" +
		"╚═╝": "(",
		"    " +
		"    " +
		"╔══╗" +
		"╚══╝" +
			"    " +
			"    ": "-",
			" " +
				" " +
				" " +
				" " +
				" " +
				" ": " ",


}

func main() {
	data, _ := ioutil.ReadFile("test.txt")
	/*dataString := ""
	for j := range data {
		//dataString += string(data[j])
		if data[j] == byte("─") {
			data[j] = byte(' ')
		}
		fmt.Println(dataString)
	}*/

	dataString := string(data)
	dataRune := []rune(dataString)
	/*for i := range dataRune {
		if dataRune[i] == '─' {
			dataRune[i] = ' '
		}
		if dataRune[i] == '╚' {
			dataRune[i] = '┗'
		}
		if dataRune[i] == '═' {
			dataRune[i] = '━'
		}
		if dataRune[i] == '╣' {
			dataRune[i] = '┫'
		}
		if dataRune[i] == '║' {
			dataRune[i] = '┃'
		}
		if dataRune[i] == '╝' {
			dataRune[i] = '┛'
		}
		if dataRune[i] == '╗' {
			dataRune[i] = '┓'
		}

		if dataRune[i] == '╔' {
			dataRune[i] = '┏'
		}

	}*/
	a := 62136
	b := 62134
	s1 := dataRune[:a]


	s2 := dataRune[a+1:a * 2+1]
	s3 := dataRune[(a * 2)+2:(a * 2 + b)+2]


	s4 := dataRune[(a * 2 + b)+3:((a + b) * 2)+3]
	s5 := dataRune[(a + b) * 2+4:a * 3 + b * 2+4]
	s6 := dataRune[a * 3 + b * 2+5:a * 3 + b * 3 + 5]
	for i := 0; i < 62130; i ++ {
		str := string(s1[i]) + string(s2[i]) + string(s3[i]) + string(s4[i]) + string(s5[i]) + string(s6[i])

		if v, ok := arr[str]; ok {

			fmt.Print(v)
		}
		str = string(s1[i:i + 2]) + string(s2[i:i + 2]) + string(s3[i:i + 2]) + string(s4[i:i + 2]) + string(s5[i:i + 2]) + string(s6[i:i + 2])
		if v, ok := arr[str]; ok {
			fmt.Print(v)
		}
		str = string(s1[i:i + 3]) + string(s2[i:i + 3]) + string(s3[i:i + 3]) + string(s4[i:i + 3]) + string(s5[i:i + 3]) + string(s6[i:i + 3])
		if v, ok := arr[str]; ok {
			fmt.Print(v)
		}
		str = string(s1[i:i + 4]) + string(s2[i:i + 4]) + string(s3[i:i + 4]) + string(s4[i:i + 4]) + string(s5[i:i + 4]) + string(s6[i:i + 4])
		if v, ok := arr[str]; ok {
			fmt.Print(v)
		}
		str = string(s1[i:i + 5]) + string(s2[i:i + 5]) + string(s3[i:i + 5]) + string(s4[i:i + 5]) + string(s5[i:i + 5]) + string(s6[i:i + 5])
		if v, ok := arr[str]; ok {
			fmt.Print(v)
		}
		str = string(s1[i:i + 6]) + string(s2[i:i + 6]) + string(s3[i:i + 6]) + string(s4[i:i + 6]) + string(s5[i:i + 6]) + string(s6[i:i + 6])
		if v, ok := arr[str]; ok {
			fmt.Print(v)
		}
		str = string(s1[i:i + 7]) + string(s2[i:i + 7]) + string(s3[i:i + 7]) + string(s4[i:i + 7]) + string(s5[i:i + 7]) + string(s6[i:i + 7])
		if v, ok := arr[str]; ok {
			fmt.Print(v)
		}
		str = string(s1[i:i + 8]) + string(s2[i:i + 8]) + string(s3[i:i + 8]) + string(s4[i:i + 8]) + string(s5[i:i + 8]) + string(s6[i:i + 8])
		if v, ok := arr[str]; ok {
			fmt.Print(v)
		}

	}
	/*for i := 0; i < 62130; i ++ {
		if string(s1[i:i + 4]) == "╔══╗" {
			if string(s2[i:i + 4]) == "║╔╗║" {

				if string(s3[i:i + 4]) == "║╚╝║" {

					if string(s4[i:i + 4]) == "║╔╗║" {

						if string(s5[i:i + 4]) == "║║║║" {
							if string(s6[i:i + 4]) == "╚╝╚╝" {
								fmt.Print("а")
							}
						}
					}
				}
			}
		}
	}*/
	//fmt.Print(sum)
	dataString = string(dataRune)
	_ = ioutil.WriteFile("test2.txt", []byte(dataString), 0644)
}


